{"pageProps":{"experiences":[{"content":"- Led back-end development efforts for key internal product initiatives in the Space and Machine Learning/Data Science problem spaces\n- Demonstrated front-end development skills on embedded client teams working with resource-constrained devices and non-traditional development tools (e.g. Smart TVs)\n- Provided support for DevOps team including building and maintaining CI/CD pipelines, implementing infrastructure as code, and monitoring and troubleshooting production environments\n- Proven ability to be a trusted sole developer on short-term client engagements, fostering strong relationships and building trust\n- Demonstrated experience designing, implementing, and deploying complex systems with a microservice architecture\n- Brought in as a fixer on teams to identify and clear blockers and implement more efficient workflows\n- Mentored junior developers, sharing knowledge and expertise to help them grow in their careers.","company":"Hyper Giant","title":"Lead Software Developer","start":"Apr. 2019","sortDate":"2019-04-09T10:35:07.322Z","end":"Current","tech":"Node.js, React, Typescript, GoLang, C#, Postgres, Redis, GraphQL, Kubernetes, Terraform"},{"content":"- Implemented critical features on multiple codebases and frameworks for high-traffic deal communities, improving user experience and driving business results\n- Identified and developed solutions to improve performance, reducing server load and response times\n- Refactored and rebuilt legacy features to improve results, flexibility, and readability, making the codebase easier to maintain and extend in the future\n- Collaborated with cross-functional teams to deliver high-quality, well-tested code that met business and technical requirements","company":"Pepper","title":"Back-End Developer","start":"Sept. 2015","sortDate":"2015-09-09T10:35:07.322Z","end":"Apr. 2019","tech":"JS, PHP (Laravel), MySQL, nginx, Docker, Redis, MemCached, Elastic Search"},{"content":"- Developed a departmental communication portal and sales tracker, providing a central hub for teams to collaborate and share information\n- Integrated the portal with a legacy dialer application, providing real-time productivity statistics and enabling managers to track team performance and identify areas for improvement\n- Performed general sysadmin duties for a wide range of systems, ensuring that they were well-maintained, secure, and available for users\n- Produced and directed live and pre-recorded community television programming, including live talk shows, and news programs\n- Mentored community members in the use of video production equipment and software, enabling them to produce their own programming\n","company":"Shaw Communications","title":"Predictive Dialer Coordinator, Master Control Operator, Master Control Operator & Community TV Producer","start":"Jun. 2007","sortDate":"2007-06-09T10:35:07.322Z","end":"Sept. 2015","tech":"JS, PHP, MySQL, Visual FoxPro (really), MS Access"}],"projects":[{"content":"Goalfeed is a service that I developed and maintain as a hobby. It provides realtime updates for NHL and MLB scores to various external consumers. Users primarily consume the feed using a Home Assistant integration that I also maintain in order to trigger light shows in their home when their favourite team scores.","company":"Goalfeed","title":"Developer/Founder","sortDate":"2019-04-09T10:35:07.322Z","tech":"golang, React.js, python, kubernetes, redis, postgres"},{"content":"I contribute or maintain a variety of open-source projects and libraries. Including but not limited to integrations for Home Assistant and the Honeywell Totalconnect python client.\n","company":"Open Source","title":"Contributor/Maintainer","sortDate":"2018-04-09T10:35:07.322Z","tech":"golang, python, kubernetes, redis, postgres"}],"volunteer":[{"content":"I have served on the board of executives for the Thistle Curling Club since 2015. In addition to providing input to help shape the future of the club, I am also responsible for club communications.","company":"Thistle Curling Club Board of Executives","title":"Executive Board Member","sortDate":"2015-04-09T10:35:07.322Z","term":"2015 - Current"},{"content":"Created and served as a writer and producer for The Week Thus Far, a comedic late-night talk show which aired throughout Manitoba over a three-year period. Lead a twelve-person creative team, produced content under strict deadlines, and trained a volunteer crew in various technical roles.\n","company":"The Week Thus Far","title":"Writer, Producer","sortDate":"2014-04-09T10:35:07.322Z","term":"2011 - 2014"}]},"__N_SSG":true}